(function (root, factory) {
  if (typeof define === 'function' && define.amd) {
    // AMD 环境，使用 define 定义模块
    define([], factory)
  } else if (typeof module === 'object' && module.exports) {
    // CommonJS 环境，使用 module.exports 导出模块
    module.exports = factory()
  } else {
    // 浏览器全局环境，将模块挂载到全局对象上
    root.CHINA_COLOR_POEMS = factory()
  }
}(typeof self !== 'undefined' ? self : this, function () {
  const CHINA_POEM_COLOR = [
    {
      color: '杏仁黄',
      poem: ['嫩黄匀遍绿枝柯，恰似杏仁初绽色']
    },
    {
      color: '茉莉黄',
      poem: ['素华映月似霜轻，嫩蕊含光带浅黄']
    },
    {
      color: '麦秆黄',
      poem: ['夜来南风起，小麦覆陇黄', '压车麦穗黄云卷，食叶蚕声白雨来', '四月南风大麦黄，枣花未落桐阴长']
    },
    {
      color: '貂紫',
      poem: ['寒欺白酒嫩，暖爱紫貂温']
    },
    {
      color: '枸枢红',
      poem: ['红果千株衬水莹，玉果垂枝红似火']
    },
    {
      color: '朱槛',
      poem: ['独凭朱槛立凌晨，山色初明水色新']
    },
    {
      color: '淡菽红',
      poem: ['竹窗红苋两三根，山色遥供水际门']
    },
    {
      color: '秋海棠红',
      poem: ['小朵娇红窈窕姿，独含秋气发花迟']
    },
    {
      color: '绛纱',
      poem: ['仙容矫矫兮杂瑶佩，轻衣重重兮蒙绛纱']
    },
    {
      color: '麝香褐',
      poem: ['莺锦蝉縠馥麝脐，轻裾花草晓烟迷']
    }
  ]

  const GRAYS = [
    {
      name: '苍色',
      color: '#75878a',
      poems: ['秋色从西来，苍然满关中。五陵北原上，万古青蒙蒙。'],
      author: '岑参',
      title: '与高适薛据同登慈恩寺浮图'
    },
    {
      name: '苍翠',
      color: '#519a73',
      poems: ['清辉澹水木，演漾在窗户。冉冉柳枝碧，娟娟花蕊红。'],
      author: '刘昚虚',
      title: '暮秋扬子江寄孟浩然'
    },
    {
      name: '苍黄',
      color: '#a29b7c',
      poems: ['三年奔走空皮骨，信有人间行路难。苍黄见乔木，掩泪经旧宅。'],
      author: '杜甫',
      title: '入宅三首其一'
    },
    {
      name: '苍青',
      color: '#7397ab',
      poems: ['峰色多苍青，川光极演漾。岩花无时歇，翠柏郁何整。'],
      author: '刘禹锡',
      title: '和河南裴尹侍郎宿斋天平寺诣九龙祠祈雨二十韵'
    },
    {
      name: '苍黑',
      color: '#395260',
      poems: ['黑云压城城欲摧，甲光向日金鳞开 。'],
      author: '李贺',
      title: ['雁门太守行']
    },
    {
      name: '苍白',
      color: '#d1d9e0',
      poems: ['君看磊落士，不肯易其身。 顾我蓬屋姿，谬通金闺籍。'],
      author: '岑参',
      title: '秋夜宿仙游寺南凉堂，呈谦道人'
    },
    {
      name: '苍色',
      color: '#75878a',
      poems: [
        '条山苍，河水黄。浪波沄沄去，松柏在高冈。',
        '太白何苍苍，星辰上森列。去天三百里，邈尔与世绝。'
      ],
      author: [
        '韩愈',
        '李白'
      ],
      title: [
        '条山苍',
        '古风・太白何苍苍'
      ]
    },
    {
      name: '苍翠',
      color: '#519a73',
      poems: [
        '寒山转苍翠，秋水日潺湲。',
        '林山相晚暮，天海空青苍。',
        '秦峰苍翠，耶溪潇洒，千岩万壑争流。'
      ],
      author: [
        '王维',
        '刘昚虚',
        '秦观'
      ],
      title: [
        '辋川闲居赠裴秀才迪',
        '暮秋扬子江寄孟浩然',
        '望海潮・秦峰苍翠'
      ]
    },
    {
      name: '苍黄',
      color: '#a29b7c',
      poems: [
        '钟山风雨起苍黄，百万雄师过大江。',
        '苍黄曾战地，空阔养雕天。',
        '避乱无深浅，苍黄古驿东。'
      ],
      author: [
        '毛泽东',
        '贯休',
        '贯休'
      ],
      title: [
        '七律・人民解放军占领南京',
        '古塞下曲七首',
        '避寇白沙驿作'
      ]
    },
    {
      name: '苍青',
      color: '#7397ab',
      poems: [
        '暑间随性百来途，逼面苍青次第铺。',
        '天寒色青苍，北风叫枯桑。',
        '君去沧江望澄碧，鲸鲵唐突留馀迹。'
      ],
      author: [
        '佚名',
        '孟郊',
        '李白'
      ],
      title: [
        '七绝・庚寅秋初宽甸山区行',
        '苦寒吟',
        '赤壁歌送别'
      ]
    }
  ]

  const REDS = [
    {
      name: '粉红',
      color: '#ffb3a7',
      poems: ['桃花一簇开无主，可爱深红爱浅红'],
      author: '杜甫',
      title: '江畔独步寻花・其五'
    },
    {
      name: '桃红',
      color: '#f47983',
      poems: ['桃红复含宿雨，柳绿更带朝烟'],
      author: '唐・王维',
      title: '田园乐七首・其六'
    },
    {
      name: '海棠红',
      color: '#db5a6b',
      poems: ['只恐夜深花睡去，故烧高烛照红妆'],
      author: '宋・苏轼',
      title: '海棠'
    },
    {
      name: '石榴红',
      color: '#f20c00',
      poems: ['日射血珠将滴地，风翻火焰欲烧人'],
      author: '唐・白居易',
      title: '山石榴寄元九'
    },
    {
      name: '樱桃色',
      color: '#c93756',
      poems: ['流光容易把人抛，红了樱桃，绿了芭蕉'],
      author: '宋・蒋捷',
      title: '一剪梅・舟过吴江'
    },
    {
      name: '大红',
      color: '#ff2121',
      poems: ['何须浅碧深红色，自是花中第一流'],
      author: '宋・李清照',
      title: '鹧鸪天・桂花'
    },
    {
      name: '绯红',
      color: '#c83c23',
      poems: ['等闲识得东风面，万紫千红总是春'],
      author: '宋・朱熹',
      title: '春日'
    },
    {
      name: '胭脂',
      color: '#9d2933',
      poems: ['林花谢了春红，太匆匆。无奈朝来寒雨，晚来风'],
      author: '五代・李煜',
      title: '相见欢・林花谢了春红'
    },
    {
      name: '丹',
      color: '#ff4e20',
      poems: ['人生自古谁无死？留取丹心照汗青'],
      author: '宋・文天祥',
      title: '过零丁洋'
    },
    {
      name: '彤',
      color: '#f35336',
      poems: ['纷纷暮雪下辕门，风掣红旗冻不翻。'],
      author: '唐・岑参',
      title: '白雪歌送武判官归京'
    },
    {
      name: '茜色',
      color: '#cb3a56',
      poems: ['凭栏人向东风泣，茜裙偷傍桃花立'],
      author: '清・陈维崧',
      title: '菩萨蛮・春雨'
    },
    {
      name: '火红',
      color: '#ff2d51',
      poems: ['日出江花红胜火，春来江水绿如蓝。能不忆江南？'],
      author: '唐・白居易',
      title: '忆江南・江南好'
    },
    {
      name: '嫣红',
      color: '#ef7a82',
      poems: ['嫣红落粉罢承恩，独向昭台坐黄昏'],
      author: '唐・王昌龄',
      title: '长信秋词五首・其一'
    },
    {
      name: '赤',
      color: '#c3272b',
      poems: ['赤日炎炎似火烧，野田禾稻半枯焦'],
      author: '施耐庵',
      title: '水浒传（相关情节唱词）'
    },
    {
      name: '殷红',
      color: '#be002f',
      poems: ['殷勤为解丁香结，放出枝间自在春'],
      author: '宋・陆佃',
      title: '依韵和双头芍药二首 其一'
    },
    {
      name: '酡颜',
      color: '#f9906f',
      poems: ['遇酒且呵呵，人生能几何！'],
      author: '五代・韦庄',
      title: '菩萨蛮・劝君今夜须沉醉'
    }
  ]

  const YELLOW = [
    {
      name: '鹅黄',
      color: '#fff143',
      poems: ['鹅黄柳色映春烟，丝雨如尘细着绵'],
      author: '宋・陆游',
      title: '春晚即事'
    },
    {
      name: '鸭黄',
      color: '#faff72',
      poems: ['短鬓惭鸥白，圆沙聚鸭黄'],
      author: '清・晓青',
      title: '过尹山访王咸中'
    },
    {
      name: '樱草色',
      color: '#eaff56',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '杏黄',
      color: '#ffa631',
      poems: ['杏子黄时麦已收，槐阴重叠柳条柔'],
      author: '宋・曹勋',
      title: '山中'
    },
    {
      name: '杏红',
      color: '#ff8c31',
      poems: ['绿杨烟外晓寒轻，红杏枝头春意闹'],
      author: '宋・宋祁',
      title: '玉楼春・春景'
    },
    {
      name: '橘黄',
      color: '#ff8936',
      poems: ['一年好景君须记，最是橙黄橘绿时'],
      author: '宋・苏轼',
      title: '赠刘景文'
    },
    {
      name: '橙黄',
      color: '#ffa400',
      poems: ['一年好景君须记，最是橙黄橘绿时'],
      author: '宋・苏轼',
      title: '赠刘景文'
    },
    {
      name: '橘红',
      color: '#ff7500',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '姜黄',
      color: '#ffc773',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '缃色',
      color: '#f0c239',
      poems: ['何须浅碧深红色，自是花中第一流'],
      author: '李清照',
      title: '鹧鸪天·桂花'
    },
    {
      name: '橙色',
      color: '#fa8c35',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '茶色',
      color: '#b35c44',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '驼色',
      color: '#a88462',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '昏黄',
      color: '#c89b40',
      poems: ['夕阳无限好，只是近黄昏'],
      author: '唐・李商隐',
      title: '乐游原'
    },
    {
      name: '栗色',
      color: '#60281e',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '棕色',
      color: '#b25d25',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '棕绿',
      color: '#827100',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '棕黑',
      color: '#7c4b00',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '棕红',
      color: '#9b4400',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '棕黄',
      color: '#ae7000',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '赭',
      color: '#9c5333',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '赭色',
      color: '#955539',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '琥珀',
      color: '#ca6924',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '褐色',
      color: '#6e511e',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '枯黄',
      color: '#d3b17d',
      poems: ['常恐秋节至，焜黄华叶衰'],
      author: '汉乐府',
      title: '长歌行'
    },
    {
      name: '黄栌',
      color: '#e29c45',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '秋色',
      color: '#896c39',
      poems: ['荆溪白石出，天寒红叶稀'],
      author: '唐・王维',
      title: '山中'
    },
    {
      name: '秋香色',
      color: '#d9b611',
      poems: [],
      author: '',
      title: ''
    }
  ]

  const GREENS = [
    {
      name: '嫩绿',
      color: '#bddd22',
      poems: ['最是一年春好处，绝胜烟柳满皇都'],
      author: '韩愈',
      title: '早春呈水部张十八员外二首・其一'
    },
    {
      name: '柳黄',
      color: '#c9dd22',
      poems: ['两个黄鹂鸣翠柳，一行白鹭上青天'],
      author: '杜甫',
      title: '绝句四首・其三'
    },
    {
      name: '柳绿',
      color: '#afdd22',
      poems: ['碧玉妆成一树高，万条垂下绿丝绦'],
      author: '贺知章',
      title: '咏柳'
    },
    {
      name: '竹青',
      color: '#789262',
      poems: ['独坐幽篁里，弹琴复长啸。深林人不知，明月来相照'],
      author: '王维',
      title: '竹里馆'
    },
    {
      name: '葱黄',
      color: '#a3d900',
      poems: ['槲叶落山路，枳花明驿墙'],
      author: '温庭筠',
      title: '商山早行'
    },
    {
      name: '葱绿',
      color: '#9ed900',
      poems: ['绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻'],
      author: '孟浩然',
      title: '过故人庄'
    },
    {
      name: '葱青',
      color: '#0eb83a',
      poems: ['北阜何其峻，林薄杳葱青'],
      author: '沈约',
      title: '锺山诗'
    },
    {
      name: '葱倩',
      color: '#0eb840',
      poems: ['葱倩满身云，酒晕浅融香颊。水调数声娴雅，把芳心偷说。'],
      author: '张炎',
      title: '好事近・赠笑倩'
    },
    {
      name: '青葱',
      color: '#0aa344',
      poems: ['青葱林间寺，近在东北隅'],
      author: '白居易',
      title: '游悟真寺诗'
    },
    {
      name: '油绿',
      color: '#00bc12',
      poems: ['春草如有情，山中尚含绿。'],
      author: '李白',
      title: '金门答苏秀才'
    },
    {
      name: '绿沈',
      color: '#0c8918',
      poems: ['雨抛金锁甲，苔卧绿沉鎗'],
      author: '杜甫',
      title: '重过何氏'
    },
    {
      name: '碧色',
      color: '#1bd1a5',
      poems: ['天门中断楚江开，碧水东流至此回'],
      author: '李白',
      title: '望天门山'
    },
    {
      name: '碧绿',
      color: '#2add9c',
      poems: ['日出江花红胜火，春来江水绿如蓝。能不忆江南？'],
      author: '白居易',
      title: '忆江南・江南好'
    },
    {
      name: '青碧',
      color: '#48c0a3',
      poems: ['日暮碧云合，佳人殊未来'],
      author: '江淹',
      title: '杂体诗三十首·休上人怨别'
    },
    {
      name: '翡翠色',
      color: '#3de1ad',
      poems: ['江上小堂巢翡翠，苑边高冢卧麒麟。'],
      author: '杜甫',
      title: '曲江二首'
    },
    {
      name: '草绿',
      color: '#40de5a',
      poems: ['国破山河在，城春草木深'],
      author: '杜甫',
      title: '春望'
    },
    {
      name: '青色',
      color: '#00e09e',
      poems: ['青山隐隐水迢迢，秋尽江南草未凋'],
      author: '杜牧',
      title: '寄扬州韩绰判官'
    },
    {
      name: '青翠',
      color: '#00e079',
      poems: ['新竹高于旧竹枝，全凭老干为扶持'],
      author: '郑燮',
      title: '新竹'
    },
    {
      name: '青白',
      color: '#c0ebd7',
      poems: ['青山看不厌，流水趣何长'],
      author: '钱起',
      title: '陪考功王员外城东池亭宴'
    },
    {
      name: '鸭卵青',
      color: '#e0eee8',
      poems: ['鹅儿黄似酒，对酒爱鹅黄'],
      author: '李郢',
      title: '鹅儿'
    },
    {
      name: '蟹壳青',
      color: '#bbcdc5',
      poems: [],
      author: '',
      title: ''
    },
    {
      name: '鸦青',
      color: '#424c50',
      poems: ['月黑见渔灯，孤光一点萤。微微风簇浪，散作满河星。'],
      author: '查慎行',
      title: '舟夜书所见'
    },
    {
      name: '绿色',
      color: '#00e500',
      poems: ['春风又绿江南岸，明月何时照我还？'],
      author: '王安石',
      title: '泊船瓜洲'
    },
    {
      name: '豆绿',
      color: '#9ed048',
      poems: ['黄梅时节家家雨，青草池塘处处蛙。'],
      author: '赵师秀',
      title: '约客'
    },
    {
      name: '豆青',
      color: '#96ce54',
      poems: ['日出而林霏开，云归而岩穴暝，晦明变化者，山间之朝暮也'],
      author: '欧阳修',
      title: '醉翁亭记'
    },
    {
      name: '石青',
      color: '#7bcfa6',
      poems: ['青冥浩荡不见底，日月照耀金银台。'],
      author: '李白',
      title: '梦游天姥吟留别'
    },
    {
      name: '玉色',
      color: '#2edfa3',
      poems: ['昆山玉碎凤凰叫，芙蓉泣露香兰笑'],
      author: '李峤',
      title: '玉'
    },
    {
      name: '缥',
      color: '#7fecad',
      poems: ['余霞散成绮，澄江静如练'],
      author: '谢朓',
      title: '晚登三山还望京邑'
    },
    {
      name: '艾绿',
      color: '#a4e2c6',
      poems: ['荷叶罗裙一色裁，芙蓉向脸两边开。'],
      author: '王昌龄',
      title: '采莲曲二首・其二'
    },
    {
      name: '松柏绿',
      color: '#21a675',
      poems: ['大雪压青松，青松挺且直'],
      author: '陈毅',
      title: '青松'
    },
    {
      name: '松花绿',
      color: '#057748',
      poems: ['松排山面千重翠，月点波心一颗珠'],
      author: ' 白居易',
      title: '春题湖上'
    },
    {
      name: '松花色',
      color: '#bce672',
      poems: ['轻肌弱骨散幽葩，更将金蕊泛流霞。'],
      author: '苏轼',
      title: '赵昌寒'
    }
  ]

  const BLUES = [
    {
      name: '蓝',
      color: '#44cef6',
      poems: [
        '日出江花红胜火，春来江水绿如蓝。能不忆江南？',
        '蓝水远从千涧落，玉山高并两峰寒。',
        '青，取之于蓝，而青于蓝；冰，水为之，而寒于水。'
      ],
      author: [
        '白居易',
        '杜甫',
        '荀子'
      ],
      title: [
        '忆江南・江南好',
        '九日蓝田崔氏庄',
        '劝学'
      ]
    },
    {
      name: '靛青',
      color: '#177cb0',
      poems: [
        '青，取之于蓝，而青于蓝。',
        '千里嘉陵江水色，含烟带月碧于蓝。'
      ],
      author: [
        '荀子',
        '李商隐'
      ],
      title: [
        '劝学',
        '望喜驿别嘉陵江水二绝'
      ]
    },
    {
      name: '靛蓝',
      color: '#065279',
      poems: [
        '长江万里白如练，淮山数点青如淀。',
        '云净长天抹靛蓝。一轮寒影浸珠帘。'
      ],
      author: [
        '周德清',
        '高濂'
      ],
      title: [
        '塞鸿秋・浔阳即景',
        '浣溪沙・其三・怀旧'
      ]
    },
    {
      name: '碧蓝',
      color: '#3eede7',
      poems: [
        '夕照红于烧，晴空碧胜蓝。',
        '碧天如练，光摇北斗阑干。'
      ],
      author: [
        '白居易',
        '孟昉'
      ],
      title: [
        '秋思',
        '天净沙・七月'
      ]
    },
    {
      name: '蔚蓝',
      color: '#70f3ff',
      poems: [
        '蔚蓝天上郁萧台，五色云旌雉尾开。',
        '茫然不悟身何处，水色天光共蔚蓝。'
      ],
      author: [
        '祝允明',
        '徐勃'
      ],
      title: [
        '法驾',
        '渡钱塘'
      ]
    },
    {
      name: '宝蓝',
      color: '#4b5cc4',
      poems: [
        '揉蓝衫子杏黄裙，独倚玉阑无语点檀唇。',
        '却爱蓝罗裙子，羡他长束纤腰。'
      ],
      author: [
        '秦观',
        '和凝'
      ],
      title: [
        '南歌子・香墨弯弯画',
        '河满子・正是破瓜年纪'
      ]
    },
    {
      name: '蓝灰色',
      color: '#a1afc9',
      poems: [
        '残花细雨半钩帘，过雨溪山总翠蓝。',
        '千山似笋怜渠瘦，一水如蓝对我寒。'
      ],
      author: [
        '张宇初',
        '郑刚中'
      ],
      title: [
        '三月一日寒食',
        '移司道中四绝'
      ]
    },
    {
      name: '藏青',
      color: '#2e4e7e',
      poems: [
        '雪拥蓝关马不前，云横秦岭家何在。',
        '蓝关月冷猿啼木，秦岭风高雁贴天。'
      ],
      author: [
        '韩愈',
        '汪元量'
      ],
      title: [
        '左迁至蓝关示侄孙湘',
        '蓝田'
      ]
    },
    {
      name: '藏蓝',
      color: '#3b2e7e',
      poems: [
        '雪拥蓝关，云横秦岭，马头道路迷茫。',
        '品流悬绝昌黎叟，一样蓝关马不前。'
      ],
      author: [
        '沈禧',
        '宋褧'
      ],
      title: [
        '满庭芳・为施克明题雪拥蓝关图',
        '闰十二月二十七日喜雪四首'
      ]
    },
    {
      name: '黛',
      color: '#4a4266',
      poems: [
        '粉白湖上云，黛青天际峰。',
        '雨过千峰濯黛青，乘凉纵目坐山亭。'
      ],
      author: [
        '岑参',
        '弘历'
      ],
      title: [
        '江上春叹',
        '雨过千峰濯黛青'
      ]
    },
    {
      name: '黛绿',
      color: '#426666',
      poems: [
        '山泼黛，水挼蓝，翠相搀。',
        '春山泼黛青淋漓，山际春禽双画眉。'
      ],
      author: [
        '黄庭坚',
        '李东阳'
      ],
      title: [
        '诉衷情・小桃灼灼柳鬖鬖',
        '春山'
      ]
    },
    {
      name: '黛蓝',
      color: '#425066',
      poems: [
        '黛青峰朵孤吟后，雪白猿儿必寄来。',
        '人知泼黛青孱颜，共喜眉宇修弯环。'
      ],
      author: [
        '贯休',
        '胡铨'
      ],
      title: [
        '寄赤松舒道士二首',
        '醉蓬莱・寿章帅'
      ]
    },
    {
      name: '黛紫',
      color: '#574266',
      poems: [
        '霜月冷，黛紫翻空，风露凛凛。',
        '紫处流霞初散绮，青者如蓝半拂烟。'
      ],
      author: [
        '吴文英',
        '李之世'
      ],
      title: [
        '一寸金・秋感',
        '矞云轩为鲁子湛题'
      ]
    },
    {
      name: '紫色',
      color: '#8d4bbb',
      poems: [
        '等闲识得东风面，万紫千红总是春。',
        '角声满天秋色里，塞上燕脂凝夜紫。'
      ],
      author: [
        '朱熹',
        '李贺'
      ],
      title: [
        '春日',
        '雁门太守行'
      ]
    },
    {
      name: '紫酱',
      color: '#815463',
      poems: [
        '何须浅碧深红色，自是花中第一流。',
        '紫薇朱槿花残，斜阳却照阑干。'
      ],
      author: [
        '李清照',
        '晏殊'
      ],
      title: [
        '鹧鸪天・桂花',
        '清平乐・金风细细'
      ]
    },
    {
      name: '酱紫',
      color: '#815476',
      poems: [
        '何须浅碧深红色，自是花中第一流。',
        '草树知春不久归，百般红紫斗芳菲。'
      ],
      author: [
        '李清照',
        '韩愈'
      ],
      title: [
        '鹧鸪天・桂花',
        '晚春二首・其一'
      ]
    },
    {
      name: '紫檀',
      color: '#4c221b',
      poems: [
        '紫檀敲寒玉，绿袍飘败荷，好个春风蓝采和。',
        '蓝田在其左，终南高且尊。'
      ],
      author: [
        '吴仁卿',
        '宋褧'
      ],
      title: [
        '【南吕】金字经・伤春落花风',
        '王君冕关中别墅芳润亭寄题二十韵'
      ]
    },
    {
      name: '绀青绀紫',
      color: '#003371',
      poems: [
        '沧海月明珠有泪，蓝田日暖玉生烟。',
        '蓝田官舍碧山里，南北红蕖照明水。'
      ],
      author: [
        '李商隐',
        '李弥逊'
      ],
      title: [
        '锦瑟',
        '仆和蹈元莲竹之什意在誉竹於莲有投鼠之嫌明'
      ]
    },
    {
      name: '紫棠',
      color: '#56004f',
      poems: [
        '雨荒深院菊，霜倒半池莲。',
        '荷香销晚夏，菊气入新秋。'
      ],
      author: [
        '杜甫',
        '骆宾王'
      ],
      title: [
        '宿赞公房',
        '晚泊江镇'
      ]
    },
    {
      name: '青莲',
      color: '#801dae',
      poems: [
        '青莲居士谪仙人，酒肆藏名三十春。',
        '若耶溪傍采莲女，笑隔荷花共人语。'
      ],
      author: [
        '李白',
        '李白'
      ],
      title: [
        '答湖州迦叶司马问白是何人',
        '采莲曲'
      ]
    },
    {
      name: '群青',
      color: '#4c8dae',
      poems: [
        '露凉时、零乱多少寒螀，神京远，惟有蓝桥路近。',
        '浆向蓝桥易乞，药成碧海难奔。'
      ],
      author: [
        '晁补之',
        '纳兰性德'
      ],
      title: [
        '洞仙歌・泗州中秋作',
        '画堂春・一生一代一双人'
      ]
    },
    {
      name: '雪青',
      color: '#b0a4e3',
      poems: [
        '梅须逊雪三分白，雪却输梅一段香。',
        '梅雪争春未肯降，骚人阁笔费评章。'
      ],
      author: [
        '卢梅坡',
        '卢梅坡'
      ],
      title: [
        '雪梅・其一',
        '雪梅・其二'
      ]
    },
    {
      name: '丁香色',
      color: '#cca4e3',
      poems: [
        '芭蕉不展丁香结，同向春风各自愁。',
        '青鸟不传云外信，丁香空结雨中愁。'
      ],
      author: [
        '李商隐',
        '李璟'
      ],
      title: [
        '代赠二首・其一',
        '摊破浣溪沙・手卷真珠上玉钩'
      ]
    },
    {
      name: '藕色',
      color: '#edd1d8',
      poems: [
        '兴尽晚回舟，误入藕花深处。争渡，争渡，惊起一滩鸥鹭。',
        '接天莲叶无穷碧，映日荷花别样红。'
      ],
      author: [
        '李清照',
        '杨万里'
      ],
      title: [
        '如梦令・常记溪亭日暮',
        '晓出净慈寺送林子方'
      ]
    },
    {
      name: '藕荷色',
      color: '#e4c6d0',
      poems: [
        '小娃撑小艇，偷采白莲回。不解藏踪迹，浮萍一道开。',
        '荷叶罗裙一色裁，芙蓉向脸两边开。'
      ],
      author: [
        '白居易',
        '王昌龄'
      ],
      title: [
        '池上二绝・其二',
        '采莲曲二首・其二'
      ]
    }
  ]

  const WATER = [
    {
      name: '水色',
      color: '#88ada6',
      poems: [
        '天容水色西湖好，云物俱鲜。鸥鹭闲眠，应惯寻常听管弦。',
        '水色南天远，舟行若在虚。',
        '桃花弄水色，波荡摇春光。'
      ],
      author: [
        '欧阳修',
        '李白',
        '李白'
      ],
      title: [
        '采桑子・天容水色西湖好',
        '送别得书字',
        '代别情人'
      ]
    },
    {
      name: '水红',
      color: '#f3d3e7',
      poems: [
        '南浦桃花亚水红，水边柳絮由春风。',
        '黄尘投老倦匆匆，故绕盆池种水红。',
        '水红须尾水红衣，白肚团员模样奇。'
      ],
      author: [
        '孟郊',
        '王安石',
        '贾似道'
      ],
      title: [
        '南浦篇',
        '壬子偶题',
        '论水红色'
      ]
    },
    {
      name: '水绿',
      color: '#d4f2e7',
      poems: [
        '池塘水绿风微暖，记得玉真初见面。',
        '春水绿波，芳时淑气和，春水澹烟波。',
        '春江波自绿，不染木兰舟。'
      ],
      author: [
        '晏殊',
        '朱休',
        '郭祥正'
      ],
      title: [
        '木兰花・池塘水绿风微暖',
        '春水绿波',
        '春水绿波'
      ]
    },
    {
      name: '水蓝',
      color: '#d2f0f4',
      poems: [
        '日出江花红胜火，春来江水绿如蓝。',
        '千里潇湘挼蓝浦，兰桡昔日曾经。',
        '揉蓝衫子杏黄裙，独倚玉阑无语点檀唇。'
      ],
      author: [
        '白居易',
        '秦观',
        '秦观'
      ],
      title: [
        '忆江南・江南好',
        '临江仙・千里潇湘挼蓝浦',
        '南歌子・香墨弯弯画'
      ]
    },
    {
      name: '淡青',
      color: '#d3e0f3',
      poems: [
        '荆溪白石出，天寒红叶稀。山路元无雨，空翠湿人衣。',
        '水色本正白，积深自成蓝。',
        '漠漠水田飞白鹭，阴阴夏木啭黄鹂。'
      ],
      author: [
        '王维',
        '欧阳修',
        '王维'
      ],
      title: [
        '山中',
        '和圣俞李侯家鸭脚子',
        '积雨辋川庄作'
      ]
    },
    {
      name: '湖蓝',
      color: '#30dff3',
      poems: [
        '镜湖增细縠，玉旻蔚浅蓝。',
        '天接海门秋水色，烟笼隋苑暮钟声。',
        '吴江水色连堤阔，越俗舂声隔岸还。'
      ],
      author: [
        '弘历',
        '许浑',
        '张祜'
      ],
      title: [
        '凉',
        '泊松江渡',
        '松江怀古'
      ]
    },
    {
      name: '湖绿',
      color: '#25f8cb',
      poems: [
        '春水满四泽，夏云多奇峰。秋月扬明晖，冬岭秀寒松。',
        '芳时淑气和，春水澹烟波。滉漾滋兰杜，沦涟长芰荷。',
        '一江涨碧碧於蓝，健橹鸣鹅舳正衔。'
      ],
      author: [
        '陶渊明',
        '朱休',
        '岳珂'
      ],
      title: [
        '四时',
        '春水绿波',
        '至鄂期年以饟事不给於诗己亥夏五廿有八日始'
      ]
    }
  ]

  const WHITE = [
    {
      name: '精白',
      color: '#ffffff',
      poems: [
        '细雨霏霏梨花白，燕拂画帘金额。',
        '白雪却嫌春色晚，故穿庭树作飞花。',
        '小山重叠金明灭，鬓云欲度香腮雪。'
      ],
      author: [
        '韦庄',
        '韩愈',
        '温庭筠'
      ],
      title: [
        '清平乐・春愁南陌',
        '春雪',
        '菩萨蛮・小山重叠金明灭'
      ]
    },
    {
      name: '象牙白',
      color: '#fffbf0',
      poems: [
        '日晃帘栊晴喷雪，风回斋阁气生兰。',
        '象牙白齿双梳子，驼骨红纹小棹篦。',
        '玉容寂寞泪阑干，梨花一枝春带雨。'
      ],
      author: [
        '陆树声',
        '吕胜己',
        '白居易'
      ],
      title: [
        '玉兰',
        '鹧鸪天',
        '长恨歌'
      ]
    },
    {
      name: '雪白',
      color: '#f2fdff',
      poems: [
        '梅须逊雪三分白，雪却输梅一段香。',
        '忽如一夜春风来，千树万树梨花开。',
        '孤舟蓑笠翁，独钓寒江雪。'
      ],
      author: [
        '卢梅坡',
        '岑参',
        '柳宗元'
      ],
      title: [
        '雪梅・其一',
        '白雪歌送武判官归京',
        '江雪'
      ]
    },
    {
      name: '月白',
      color: '#d6ecf0',
      poems: [
        '月白烟青水暗流，孤猿衔恨叫中秋。',
        '东船西舫悄无言，唯见江心秋月白。',
        '酒渴起夜汲，月白天正青。'
      ],
      author: [
        '杜牧',
        '白居易',
        '陆游'
      ],
      title: [
        '猿',
        '琵琶行',
        '夜汲'
      ]
    },
    {
      name: '缟',
      color: '#f2ecde',
      poems: [
        '缟素酬家国，戈船决死生！'
      ],
      author: [
        '夏完淳'
      ],
      title: [
        '即事三首・其一'
      ]
    },
    {
      name: '素',
      color: '#e0f0e9',
      poems: [
        '素衣莫起风尘叹，犹及清明可到家。'
      ],
      author: [
        '陆游'
      ],
      title: [
        '临安春雨初霁'
      ]
    },
    {
      name: '荼白',
      color: '#f3f9f1',
      poems: [
        '荼白花开风递香，枝横碧玉天然瘦。',
        '梅子金黄杏子肥，麦花雪白菜花稀。',
        '零落成泥碾作尘，只有香如故。'
      ],
      author: [
        '佚名',
        '范成大',
        '陆游'
      ],
      title: [
        '民间流传对荼白花描写的诗句',
        '四时田园杂兴・其二',
        '卜算子・咏梅'
      ]
    },
    {
      name: '霜色',
      color: '#e9f1f6',
      poems: [
        '月落乌啼霜满天，江枫渔火对愁眠。',
        '停车坐爱枫林晚，霜叶红于二月花。',
        '晓镜但愁云鬓改，夜吟应觉月光寒。'
      ],
      author: [
        '张继',
        '杜牧',
        '李商隐'
      ],
      title: [
        '枫桥夜泊',
        '山行',
        '无题・相见时难别亦难'
      ]
    },
    {
      name: '花白',
      color: '#c2ccd0',
      poems: [
        '桃花一簇开无主，可爱深红爱浅红。',
        '人闲桂花落，夜静春山空。',
        '白锦无纹香烂漫，玉树琼葩堆雪。'
      ],
      author: [
        '杜甫',
        '王维',
        '丘处机'
      ],
      title: [
        '江畔独步寻花・其六',
        '鸟鸣涧',
        '无俗念・灵虚宫梨花词'
      ]
    },
    {
      name: '鱼肚白',
      color: '#fcefe8',
      poems: [
        '东船西舫悄无言，唯见江心秋月白。',
        '落霞与孤鹜齐飞，秋水共长天一色。',
        '晓色初开，淡烟未散，风动霜华满路'
      ],
      author: [
        '白居易',
        '王勃',
        '张矩'
      ],
      title: [
        '琵琶行',
        '滕王阁序',
        '应天长・柳湖载酒'
      ]
    },
    {
      name: '莹白',
      color: '#e3f9fd',
      poems: [
        '素质鲜明绝点尘，冰轮高照转精神。'
      ],
      author: [
        '史铸'
      ],
      title: [
        '月下白'
      ]
    },
    {
      name: '灰色',
      color: '#808080',
      poems: [
        '远上寒山石径斜，白云生处有人家。',
        '烟笼寒水月笼沙，夜泊秦淮近酒家。',
        '千山鸟飞绝，万径人踪灭。孤舟蓑笠翁，独钓寒江雪。'
      ],
      author: [
        '杜牧',
        '杜牧',
        '柳宗元'
      ],
      title: [
        '山行',
        '泊秦淮',
        '江雪'
      ]
    },
    {
      name: '牙色',
      color: '#eedeb0',
      poems: [
        '水色天光上下寒，忘机鸥鸟恣飞还。',
        '梨花院落溶溶月，柳絮池塘淡淡风。'
      ],
      author: [
        '释文珦',
        '晏殊'
      ],
      title: [
        '题水天清话图',
        '寓意'
      ]
    },
    {
      name: '铅白',
      color: '#f0f0f4',
      poems: [
        '玉容寂寞泪阑干，梨花一枝春带雨。',
        '白锦无纹香烂漫，玉树琼葩堆雪。'
      ],
      author: [
        '白居易',
        '丘处机'
      ],
      title: [
        '长恨歌',
        '无俗念・灵虚宫梨花词'
      ]
    }
  ]

  const BLACK = [
    {
      name: '玄色',
      color: '#622a1d',
      poems: ['我马玄黄盼草青，关河迢递梦魂停。'],
      author: ['蔡淑萍'],
      title: ['旅怀']
    },
    {
      name: '玄青',
      color: '#3d3b4f',
      poems: ['雨湿松阴凉，风落松花细。独鹤爱清幽，飞来不飞去。'],
      author: ['戴亨'],
      title: ['松鹤图']
    },
    {
      name: '乌色',
      color: '#725e82',
      poems: ['乌色天容暮，青怀道味长。'],
      author: ['李复'],
      title: ['依韵酬李叔玠见寄']
    },
    {
      name: '乌黑',
      color: '#392f41',
      poems: ['乌黑云头白脚花，尽从徽墨幻成家。'],
      author: ['徐渭'],
      title: ['画百花卷与史甥，题曰《漱老谑墨》']
    },
    {
      name: '漆黑',
      color: '#161823',
      poems: ['岩扉夜不掩，漆黑无寸光。'],
      author: ['徐勃'],
      title: ['宿鼓山绝顶']
    },
    {
      name: '墨色',
      color: '#50616d',
      poems: ['墨色淋漓人不见，空教蛱蝶绕东墙。'],
      author: ['徐勃'],
      title: ['画蝶']
    },
    {
      name: '墨灰',
      color: '#758a99',
      poems: ['墨灰融烛泪，酒色上花颜。'],
      author: ['王彦泓'],
      title: ['即事']
    },
    {
      name: '黑色',
      color: '#000000',
      poems: ['黑云压城城欲摧，甲光向日金鳞开。'],
      author: ['李贺'],
      title: ['雁门太守行']
    },
    {
      name: '缁色',
      color: '#493131',
      poems: ['缁尘素发惊残岁，故旧凋零已怕看。'],
      author: ['丘葵'],
      title: ['和所盘自宽韵']
    },
    {
      name: '煤黑',
      color: '#312520',
      poems: ['墨煤黑滑霜兔健，我亦自惜毛锥秃。'],
      author: ['苏轼'],
      title: ['次韵孔文仲推官见赠']
    },
    {
      name: '黧',
      color: '#5d513c',
      poems: ['山妻面黧黑，稚子发鬅鬙。'],
      author: ['方回'],
      title: ['秀山霜晴晚眺与赵宾旸黄惟月联句']
    },
    {
      name: '黎',
      color: '#75664d',
      poems: ['黎明发新邑，亭午过旧都。'],
      author: ['李廌'],
      title: ['送霍子侔还都']
    },
    {
      name: '黝',
      color: '#6b6882',
      poems: ['黝然苍石底，伏此垂老螭。'],
      author: ['强至'],
      title: ['怪石']
    },
    {
      name: '黝黑',
      color: '#665757',
      poems: ['土脉正膏腴，溜泉来黝黑。'],
      author: ['李吕'],
      title: ['题云谷耕隐']
    },
    {
      name: '黯',
      color: '#41555d',
      poems: ['黯黯江云瓜步雨，萧萧木叶石城秋。'],
      author: ['陆游'],
      title: ['登赏心亭']
    }
  ]

  const GOLD = [
    {
      name: '赤金',
      color: '#f2be45',
      poems: ['赤金盘里盛朱橘，未到嘴边先觉香。'],
      author: ['韦庄'],
      title: ['叹庭前甘菊花']
    },
    {
      name: '金色',
      color: '#eacd76',
      poems: ['金色界中兜率景，碧莲花里梵王宫。'],
      author: ['释延寿'],
      title: ['武肃王有旨石桥设斋会进士一诗共六首 其四']
    },
    {
      name: '银白',
      color: '#e9e7ef',
      poems: ['银白香肌透骨鲜，堪随玉筯伴神仙。'],
      author: ['徐勃'],
      title: ['荔枝谱（有序） 其十六 丁香']
    },
    {
      name: '老银',
      color: '#bacac6',
      poems: ['老银色界月为骨，黄金仙山珠作林。'],
      author: ['杨万里'],
      title: ['雪后十日日暖雪犹未融']
    },
    {
      name: '乌金',
      color: '#a78e44',
      poems: ['乌金欲买愁无直，指佞空闻有此花。'],
      author: ['徐勃'],
      title: ['买石']
    },
    {
      name: '铜绿',
      color: '#549688',
      poems: ['雨余铜绿蚀蜗牛，庭砌无人草渐稠。'],
      author: ['华岳'],
      title: ['书斋']
    }
  ]
  return [...GRAYS, ...REDS, ...YELLOW, ...GREENS, ...BLUES, ...WATER, ...WHITE, ...BLACK, ...GOLD]
}))
