const GRAYS = [
  {
    name: '苍色',
    color: '#75878a',
    poems: ['秋色从西来，苍然满关中。五陵北原上，万古青蒙蒙。'],
    author: '岑参',
    title: '与高适薛据同登慈恩寺浮图'
  },
  {
    name: '苍翠',
    color: '#519a73',
    poems: ['清辉澹水木，演漾在窗户。冉冉柳枝碧，娟娟花蕊红。'],
    author: '刘昚虚',
    title: '暮秋扬子江寄孟浩然'
  },
  {
    name: '苍黄',
    color: '#a29b7c',
    poems: ['三年奔走空皮骨，信有人间行路难。苍黄见乔木，掩泪经旧宅。'],
    author: '杜甫',
    title: '入宅三首其一'
  },
  {
    name: '苍青',
    color: '#7397ab',
    poems: ['峰色多苍青，川光极演漾。岩花无时歇，翠柏郁何整。'],
    author: '刘禹锡',
    title: '和河南裴尹侍郎宿斋天平寺诣九龙祠祈雨二十韵'
  },
  {
    name: '苍黑',
    color: '#395260',
    poems: ['黑云压城城欲摧，甲光向日金鳞开 。'],
    author: '李贺',
    title: ['雁门太守行']
  },
  {
    name: '苍白',
    color: '#d1d9e0',
    poems: ['君看磊落士，不肯易其身。 顾我蓬屋姿，谬通金闺籍。'],
    author: '岑参',
    title: '秋夜宿仙游寺南凉堂，呈谦道人'
  },
  {
    name: '苍色',
    color: '#75878a',
    poems: [
      '太白何苍苍，星辰上森列。去天三百里，邈尔与世绝。'
    ],
    author: [
      '李白'
    ],
    title: [
      '古风・太白何苍苍'
    ]
  },
  {
    name: '苍翠',
    color: '#519a73',
    poems: [
      '寒山转苍翠，秋水日潺湲。',
      '林山相晚暮，天海空青苍。'
    ],
    author: [
      '王维',
      '刘昚虚'
    ],
    title: [
      '辋川闲居赠裴秀才迪',
      '暮秋扬子江寄孟浩然'
    ]
  },
  {
    name: '苍黄',
    color: '#a29b7c',
    poems: [
      '钟山风雨起苍黄，百万雄师过大江。',
      '苍黄曾战地，空阔养雕天。',
      '避乱无深浅，苍黄古驿东。'
    ],
    author: [
      '毛泽东',
      '贯休',
      '贯休'
    ],
    title: [
      '七律・人民解放军占领南京',
      '古塞下曲七首',
      '避寇白沙驿作'
    ]
  },
  {
    name: '苍青',
    color: '#7397ab',
    poems: [
      '暑间随性百来途，逼面苍青次第铺。',
      '天寒色青苍，北风叫枯桑。',
      '君去沧江望澄碧，鲸鲵唐突留馀迹。'
    ],
    author: [
      '佚名',
      '孟郊',
      '李白'
    ],
    title: [
      '七绝・庚寅秋初宽甸山区行',
      '苦寒吟',
      '赤壁歌送别'
    ]
  }
]

const REDS = [
  {
    name: '粉红',
    color: '#ffb3a7',
    poems: ['桃花一簇开无主，可爱深红爱浅红'],
    author: '杜甫',
    title: '江畔独步寻花・其五'
  },
  {
    name: '桃红',
    color: '#f47983',
    poems: ['桃红复含宿雨，柳绿更带朝烟'],
    author: '唐・王维',
    title: '田园乐七首・其六'
  },
  {
    name: '海棠红',
    color: '#db5a6b',
    poems: ['只恐夜深花睡去，故烧高烛照红妆'],
    author: '宋・苏轼',
    title: '海棠'
  },
  {
    name: '石榴红',
    color: '#f20c00',
    poems: ['日射血珠将滴地，风翻火焰欲烧人'],
    author: '唐・白居易',
    title: '山石榴寄元九'
  },
  {
    name: '樱桃色',
    color: '#c93756',
    poems: ['流光容易把人抛，红了樱桃，绿了芭蕉'],
    author: '宋・蒋捷',
    title: '一剪梅・舟过吴江'
  },
  {
    name: '大红',
    color: '#ff2121',
    poems: ['何须浅碧深红色，自是花中第一流'],
    author: '宋・李清照',
    title: '鹧鸪天・桂花'
  },
  {
    name: '绯红',
    color: '#c83c23',
    poems: ['等闲识得东风面，万紫千红总是春'],
    author: '宋・朱熹',
    title: '春日'
  },
  {
    name: '胭脂',
    color: '#9d2933',
    poems: ['林花谢了春红，太匆匆。无奈朝来寒雨，晚来风'],
    author: '五代・李煜',
    title: '相见欢・林花谢了春红'
  },
  {
    name: '丹',
    color: '#ff4e20',
    poems: ['人生自古谁无死？留取丹心照汗青'],
    author: '宋・文天祥',
    title: '过零丁洋'
  },
  {
    name: '彤',
    color: '#f35336',
    poems: ['纷纷暮雪下辕门，风掣红旗冻不翻。'],
    author: '唐・岑参',
    title: '白雪歌送武判官归京'
  },
  {
    name: '茜色',
    color: '#cb3a56',
    poems: ['凭栏人向东风泣，茜裙偷傍桃花立'],
    author: '清・陈维崧',
    title: '菩萨蛮・春雨'
  },
  {
    name: '火红',
    color: '#ff2d51',
    poems: ['日出江花红胜火，春来江水绿如蓝。能不忆江南？'],
    author: '唐・白居易',
    title: '忆江南・江南好'
  },
  {
    name: '嫣红',
    color: '#ef7a82',
    poems: ['嫣红落粉罢承恩，独向昭台坐黄昏'],
    author: '唐・王昌龄',
    title: '长信秋词五首・其一'
  },
  {
    name: '赤',
    color: '#c3272b',
    poems: ['赤日炎炎似火烧，野田禾稻半枯焦'],
    author: '施耐庵',
    title: '水浒传（相关情节唱词）'
  },
  {
    name: '殷红',
    color: '#be002f',
    poems: ['殷勤为解丁香结，放出枝间自在春'],
    author: '宋・陆佃',
    title: '依韵和双头芍药二首 其一'
  },
  {
    name: '酡颜',
    color: '#f9906f',
    poems: ['遇酒且呵呵，人生能几何！'],
    author: '五代・韦庄',
    title: '菩萨蛮・劝君今夜须沉醉'
  }
]

const YELLOW = [
  {
    name: '鹅黄',
    color: '#fff143',
    poems: ['鹅黄柳色映春烟，丝雨如尘细着绵'],
    author: '宋・陆游',
    title: '春晚即事'
  },
  {
    name: '鸭黄',
    color: '#faff72',
    poems: ['短鬓惭鸥白，圆沙聚鸭黄'],
    author: '清・晓青',
    title: '过尹山访王咸中'
  },
  {
    name: '杏黄',
    color: '#ffa631',
    poems: ['杏子黄时麦已收，槐阴重叠柳条柔'],
    author: '宋・曹勋',
    title: '山中'
  },
  {
    name: '杏红',
    color: '#ff8c31',
    poems: ['绿杨烟外晓寒轻，红杏枝头春意闹'],
    author: '宋・宋祁',
    title: '玉楼春・春景'
  },
  {
    name: '橘黄',
    color: '#ff8936',
    poems: ['一年好景君须记，最是橙黄橘绿时'],
    author: '宋・苏轼',
    title: '赠刘景文'
  },
  {
    name: '橙黄',
    color: '#ffa400',
    poems: ['一年好景君须记，最是橙黄橘绿时'],
    author: '宋・苏轼',
    title: '赠刘景文'
  },
  {
    name: '缃色',
    color: '#f0c239',
    poems: ['何须浅碧深红色，自是花中第一流'],
    author: '李清照',
    title: '鹧鸪天·桂花'
  },
  {
    name: '昏黄',
    color: '#c89b40',
    poems: ['夕阳无限好，只是近黄昏'],
    author: '唐・李商隐',
    title: '乐游原'
  },
  {
    name: '枯黄',
    color: '#d3b17d',
    poems: ['常恐秋节至，焜黄华叶衰'],
    author: '汉乐府',
    title: '长歌行'
  },
  {
    name: '秋色',
    color: '#896c39',
    poems: ['荆溪白石出，天寒红叶稀'],
    author: '唐・王维',
    title: '山中'
  }
]

const GREENS = [
  {
    name: '嫩绿',
    color: '#bddd22',
    poems: ['最是一年春好处，绝胜烟柳满皇都'],
    author: '韩愈',
    title: '早春呈水部张十八员外二首・其一'
  },
  {
    name: '柳黄',
    color: '#c9dd22',
    poems: ['两个黄鹂鸣翠柳，一行白鹭上青天'],
    author: '杜甫',
    title: '绝句四首・其三'
  },
  {
    name: '柳绿',
    color: '#afdd22',
    poems: ['碧玉妆成一树高，万条垂下绿丝绦'],
    author: '贺知章',
    title: '咏柳'
  },
  {
    name: '竹青',
    color: '#789262',
    poems: ['独坐幽篁里，弹琴复长啸。深林人不知，明月来相照'],
    author: '王维',
    title: '竹里馆'
  },
  {
    name: '葱黄',
    color: '#a3d900',
    poems: ['槲叶落山路，枳花明驿墙'],
    author: '温庭筠',
    title: '商山早行'
  },
  {
    name: '葱绿',
    color: '#9ed900',
    poems: ['绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻'],
    author: '孟浩然',
    title: '过故人庄'
  },
  {
    name: '葱青',
    color: '#0eb83a',
    poems: ['北阜何其峻，林薄杳葱青'],
    author: '沈约',
    title: '锺山诗'
  },
  {
    name: '葱倩',
    color: '#0eb840',
    poems: ['葱倩满身云，酒晕浅融香颊。水调数声娴雅，把芳心偷说。'],
    author: '张炎',
    title: '好事近・赠笑倩'
  },
  {
    name: '青葱',
    color: '#0aa344',
    poems: ['青葱林间寺，近在东北隅'],
    author: '白居易',
    title: '游悟真寺诗'
  },
  {
    name: '油绿',
    color: '#00bc12',
    poems: ['春草如有情，山中尚含绿。'],
    author: '李白',
    title: '金门答苏秀才'
  },
  {
    name: '绿沈',
    color: '#0c8918',
    poems: ['雨抛金锁甲，苔卧绿沉鎗'],
    author: '杜甫',
    title: '重过何氏'
  },
  {
    name: '碧色',
    color: '#1bd1a5',
    poems: ['天门中断楚江开，碧水东流至此回'],
    author: '李白',
    title: '望天门山'
  },
  {
    name: '碧绿',
    color: '#2add9c',
    poems: ['日出江花红胜火，春来江水绿如蓝。能不忆江南？'],
    author: '白居易',
    title: '忆江南・江南好'
  },
  {
    name: '青碧',
    color: '#48c0a3',
    poems: ['日暮碧云合，佳人殊未来'],
    author: '江淹',
    title: '杂体诗三十首·休上人怨别'
  },
  {
    name: '翡翠色',
    color: '#3de1ad',
    poems: ['江上小堂巢翡翠，苑边高冢卧麒麟。'],
    author: '杜甫',
    title: '曲江二首'
  },
  {
    name: '草绿',
    color: '#40de5a',
    poems: ['国破山河在，城春草木深'],
    author: '杜甫',
    title: '春望'
  },
  {
    name: '青色',
    color: '#00e09e',
    poems: ['青山隐隐水迢迢，秋尽江南草未凋'],
    author: '杜牧',
    title: '寄扬州韩绰判官'
  },
  {
    name: '青翠',
    color: '#00e079',
    poems: ['新竹高于旧竹枝，全凭老干为扶持'],
    author: '郑燮',
    title: '新竹'
  },
  {
    name: '青白',
    color: '#c0ebd7',
    poems: ['青山看不厌，流水趣何长'],
    author: '钱起',
    title: '陪考功王员外城东池亭宴'
  },
  {
    name: '鸭卵青',
    color: '#e0eee8',
    poems: ['鹅儿黄似酒，对酒爱鹅黄'],
    author: '李郢',
    title: '鹅儿'
  },
  {
    name: '鸦青',
    color: '#424c50',
    poems: ['月黑见渔灯，孤光一点萤。微微风簇浪，散作满河星。'],
    author: '查慎行',
    title: '舟夜书所见'
  },
  {
    name: '绿色',
    color: '#00e500',
    poems: ['春风又绿江南岸，明月何时照我还？'],
    author: '王安石',
    title: '泊船瓜洲'
  },
  {
    name: '豆绿',
    color: '#9ed048',
    poems: ['黄梅时节家家雨，青草池塘处处蛙。'],
    author: '赵师秀',
    title: '约客'
  },
  {
    name: '豆青',
    color: '#96ce54',
    poems: ['日出而林霏开，云归而岩穴暝，晦明变化者，山间之朝暮也'],
    author: '欧阳修',
    title: '醉翁亭记'
  },
  {
    name: '石青',
    color: '#7bcfa6',
    poems: ['青冥浩荡不见底，日月照耀金银台。'],
    author: '李白',
    title: '梦游天姥吟留别'
  },
  {
    name: '玉色',
    color: '#2edfa3',
    poems: ['昆山玉碎凤凰叫，芙蓉泣露香兰笑'],
    author: '李峤',
    title: '玉'
  },
  {
    name: '缥',
    color: '#7fecad',
    poems: ['余霞散成绮，澄江静如练'],
    author: '谢朓',
    title: '晚登三山还望京邑'
  },
  {
    name: '艾绿',
    color: '#a4e2c6',
    poems: ['荷叶罗裙一色裁，芙蓉向脸两边开。'],
    author: '王昌龄',
    title: '采莲曲二首・其二'
  },
  {
    name: '松柏绿',
    color: '#21a675',
    poems: ['大雪压青松，青松挺且直'],
    author: '陈毅',
    title: '青松'
  },
  {
    name: '松花绿',
    color: '#057748',
    poems: ['松排山面千重翠，月点波心一颗珠'],
    author: ' 白居易',
    title: '春题湖上'
  },
  {
    name: '松花色',
    color: '#bce672',
    poems: ['轻肌弱骨散幽葩，更将金蕊泛流霞。'],
    author: '苏轼',
    title: '赵昌寒'
  }
]

const BLUES = [
  {
    name: '蓝',
    color: '#44cef6',
    poems: [
      '日出江花红胜火，春来江水绿如蓝。能不忆江南？',
      '蓝水远从千涧落，玉山高并两峰寒。',
      '青，取之于蓝，而青于蓝；冰，水为之，而寒于水。'
    ],
    author: [
      '白居易',
      '杜甫',
      '荀子'
    ],
    title: [
      '忆江南・江南好',
      '九日蓝田崔氏庄',
      '劝学'
    ]
  },
  {
    name: '靛青',
    color: '#177cb0',
    poems: [
      '青，取之于蓝，而青于蓝。',
      '千里嘉陵江水色，含烟带月碧于蓝。'
    ],
    author: [
      '荀子',
      '李商隐'
    ],
    title: [
      '劝学',
      '望喜驿别嘉陵江水二绝'
    ]
  },
  {
    name: '靛蓝',
    color: '#065279',
    poems: [
      '长江万里白如练，淮山数点青如淀。',
      '云净长天抹靛蓝。一轮寒影浸珠帘。'
    ],
    author: [
      '周德清',
      '高濂'
    ],
    title: [
      '塞鸿秋・浔阳即景',
      '浣溪沙・其三・怀旧'
    ]
  },
  {
    name: '碧蓝',
    color: '#3eede7',
    poems: [
      '夕照红于烧，晴空碧胜蓝。',
      '碧天如练，光摇北斗阑干。'
    ],
    author: [
      '白居易',
      '孟昉'
    ],
    title: [
      '秋思',
      '天净沙・七月'
    ]
  },
  {
    name: '蔚蓝',
    color: '#70f3ff',
    poems: [
      '蔚蓝天上郁萧台，五色云旌雉尾开。',
      '茫然不悟身何处，水色天光共蔚蓝。'
    ],
    author: [
      '祝允明',
      '徐勃'
    ],
    title: [
      '法驾',
      '渡钱塘'
    ]
  },
  {
    name: '宝蓝',
    color: '#4b5cc4',
    poems: [
      '揉蓝衫子杏黄裙，独倚玉阑无语点檀唇。',
      '却爱蓝罗裙子，羡他长束纤腰。'
    ],
    author: [
      '秦观',
      '和凝'
    ],
    title: [
      '南歌子・香墨弯弯画',
      '河满子・正是破瓜年纪'
    ]
  },
  {
    name: '蓝灰色',
    color: '#a1afc9',
    poems: [
      '残花细雨半钩帘，过雨溪山总翠蓝。',
      '千山似笋怜渠瘦，一水如蓝对我寒。'
    ],
    author: [
      '张宇初',
      '郑刚中'
    ],
    title: [
      '三月一日寒食',
      '移司道中四绝'
    ]
  },
  {
    name: '藏青',
    color: '#2e4e7e',
    poems: [
      '雪拥蓝关马不前，云横秦岭家何在。',
      '蓝关月冷猿啼木，秦岭风高雁贴天。'
    ],
    author: [
      '韩愈',
      '汪元量'
    ],
    title: [
      '左迁至蓝关示侄孙湘',
      '蓝田'
    ]
  },
  {
    name: '藏蓝',
    color: '#3b2e7e',
    poems: [
      '雪拥蓝关，云横秦岭，马头道路迷茫。',
      '品流悬绝昌黎叟，一样蓝关马不前。'
    ],
    author: [
      '沈禧',
      '宋褧'
    ],
    title: [
      '满庭芳・为施克明题雪拥蓝关图',
      '闰十二月二十七日喜雪四首'
    ]
  },
  {
    name: '黛',
    color: '#4a4266',
    poems: [
      '粉白湖上云，黛青天际峰。',
      '雨过千峰濯黛青，乘凉纵目坐山亭。'
    ],
    author: [
      '岑参',
      '弘历'
    ],
    title: [
      '江上春叹',
      '雨过千峰濯黛青'
    ]
  },
  {
    name: '黛绿',
    color: '#426666',
    poems: [
      '山泼黛，水挼蓝，翠相搀。',
      '春山泼黛青淋漓，山际春禽双画眉。'
    ],
    author: [
      '黄庭坚',
      '李东阳'
    ],
    title: [
      '诉衷情・小桃灼灼柳鬖鬖',
      '春山'
    ]
  },
  {
    name: '黛蓝',
    color: '#425066',
    poems: [
      '黛青峰朵孤吟后，雪白猿儿必寄来。',
      '人知泼黛青孱颜，共喜眉宇修弯环。'
    ],
    author: [
      '贯休',
      '胡铨'
    ],
    title: [
      '寄赤松舒道士二首',
      '醉蓬莱・寿章帅'
    ]
  },
  {
    name: '黛紫',
    color: '#574266',
    poems: [
      '霜月冷，黛紫翻空，风露凛凛。',
      '紫处流霞初散绮，青者如蓝半拂烟。'
    ],
    author: [
      '吴文英',
      '李之世'
    ],
    title: [
      '一寸金・秋感',
      '矞云轩为鲁子湛题'
    ]
  },
  {
    name: '紫色',
    color: '#8d4bbb',
    poems: [
      '等闲识得东风面，万紫千红总是春。',
      '角声满天秋色里，塞上燕脂凝夜紫。'
    ],
    author: [
      '朱熹',
      '李贺'
    ],
    title: [
      '春日',
      '雁门太守行'
    ]
  },
  {
    name: '紫酱',
    color: '#815463',
    poems: [
      '何须浅碧深红色，自是花中第一流。',
      '紫薇朱槿花残，斜阳却照阑干。'
    ],
    author: [
      '李清照',
      '晏殊'
    ],
    title: [
      '鹧鸪天・桂花',
      '清平乐・金风细细'
    ]
  },
  {
    name: '酱紫',
    color: '#815476',
    poems: [
      '何须浅碧深红色，自是花中第一流。',
      '草树知春不久归，百般红紫斗芳菲。'
    ],
    author: [
      '李清照',
      '韩愈'
    ],
    title: [
      '鹧鸪天・桂花',
      '晚春二首・其一'
    ]
  },
  {
    name: '紫檀',
    color: '#4c221b',
    poems: [
      '紫檀敲寒玉，绿袍飘败荷，好个春风蓝采和。',
      '蓝田在其左，终南高且尊。'
    ],
    author: [
      '吴仁卿',
      '宋褧'
    ],
    title: [
      '【南吕】金字经・伤春落花风',
      '王君冕关中别墅芳润亭寄题二十韵'
    ]
  },
  {
    name: '绀青绀紫',
    color: '#003371',
    poems: [
      '沧海月明珠有泪，蓝田日暖玉生烟。',
      '蓝田官舍碧山里，南北红蕖照明水。'
    ],
    author: [
      '李商隐',
      '李弥逊'
    ],
    title: [
      '锦瑟',
      '仆和蹈元莲竹之什意在誉竹於莲有投鼠之嫌明'
    ]
  },
  {
    name: '紫棠',
    color: '#56004f',
    poems: [
      '雨荒深院菊，霜倒半池莲。',
      '荷香销晚夏，菊气入新秋。'
    ],
    author: [
      '杜甫',
      '骆宾王'
    ],
    title: [
      '宿赞公房',
      '晚泊江镇'
    ]
  },
  {
    name: '青莲',
    color: '#801dae',
    poems: [
      '青莲居士谪仙人，酒肆藏名三十春。',
      '若耶溪傍采莲女，笑隔荷花共人语。'
    ],
    author: [
      '李白',
      '李白'
    ],
    title: [
      '答湖州迦叶司马问白是何人',
      '采莲曲'
    ]
  },
  {
    name: '群青',
    color: '#4c8dae',
    poems: [
      '露凉时、零乱多少寒螀，神京远，惟有蓝桥路近。',
      '浆向蓝桥易乞，药成碧海难奔。'
    ],
    author: [
      '晁补之',
      '纳兰性德'
    ],
    title: [
      '洞仙歌・泗州中秋作',
      '画堂春・一生一代一双人'
    ]
  },
  {
    name: '雪青',
    color: '#b0a4e3',
    poems: [
      '梅须逊雪三分白，雪却输梅一段香。',
      '梅雪争春未肯降，骚人阁笔费评章。'
    ],
    author: [
      '卢梅坡',
      '卢梅坡'
    ],
    title: [
      '雪梅・其一',
      '雪梅・其二'
    ]
  },
  {
    name: '丁香色',
    color: '#cca4e3',
    poems: [
      '芭蕉不展丁香结，同向春风各自愁。',
      '青鸟不传云外信，丁香空结雨中愁。'
    ],
    author: [
      '李商隐',
      '李璟'
    ],
    title: [
      '代赠二首・其一',
      '摊破浣溪沙・手卷真珠上玉钩'
    ]
  },
  {
    name: '藕色',
    color: '#edd1d8',
    poems: [
      '兴尽晚回舟，误入藕花深处。争渡，争渡，惊起一滩鸥鹭。',
      '接天莲叶无穷碧，映日荷花别样红。'
    ],
    author: [
      '李清照',
      '杨万里'
    ],
    title: [
      '如梦令・常记溪亭日暮',
      '晓出净慈寺送林子方'
    ]
  },
  {
    name: '藕荷色',
    color: '#e4c6d0',
    poems: [
      '小娃撑小艇，偷采白莲回。不解藏踪迹，浮萍一道开。',
      '荷叶罗裙一色裁，芙蓉向脸两边开。'
    ],
    author: [
      '白居易',
      '王昌龄'
    ],
    title: [
      '池上二绝・其二',
      '采莲曲二首・其二'
    ]
  }
]

const WATER = [
  {
    name: '水色',
    color: '#88ada6',
    poems: [
      '天容水色西湖好，云物俱鲜。鸥鹭闲眠，应惯寻常听管弦。',
      '水色南天远，舟行若在虚。',
      '桃花弄水色，波荡摇春光。'
    ],
    author: [
      '欧阳修',
      '李白',
      '李白'
    ],
    title: [
      '采桑子・天容水色西湖好',
      '送别得书字',
      '代别情人'
    ]
  },
  {
    name: '水红',
    color: '#f3d3e7',
    poems: [
      '南浦桃花亚水红，水边柳絮由春风。',
      '黄尘投老倦匆匆，故绕盆池种水红。',
      '水红须尾水红衣，白肚团员模样奇。'
    ],
    author: [
      '孟郊',
      '王安石',
      '贾似道'
    ],
    title: [
      '南浦篇',
      '壬子偶题',
      '论水红色'
    ]
  },
  {
    name: '水绿',
    color: '#d4f2e7',
    poems: [
      '池塘水绿风微暖，记得玉真初见面。',
      '春水绿波，芳时淑气和，春水澹烟波。',
      '春江波自绿，不染木兰舟。'
    ],
    author: [
      '晏殊',
      '朱休',
      '郭祥正'
    ],
    title: [
      '木兰花・池塘水绿风微暖',
      '春水绿波',
      '春水绿波'
    ]
  },
  {
    name: '水蓝',
    color: '#d2f0f4',
    poems: [
      '日出江花红胜火，春来江水绿如蓝。',
      '千里潇湘挼蓝浦，兰桡昔日曾经。',
      '揉蓝衫子杏黄裙，独倚玉阑无语点檀唇。'
    ],
    author: [
      '白居易',
      '秦观',
      '秦观'
    ],
    title: [
      '忆江南・江南好',
      '临江仙・千里潇湘挼蓝浦',
      '南歌子・香墨弯弯画'
    ]
  },
  {
    name: '淡青',
    color: '#d3e0f3',
    poems: [
      '荆溪白石出，天寒红叶稀。山路元无雨，空翠湿人衣。',
      '水色本正白，积深自成蓝。',
      '漠漠水田飞白鹭，阴阴夏木啭黄鹂。'
    ],
    author: [
      '王维',
      '欧阳修',
      '王维'
    ],
    title: [
      '山中',
      '和圣俞李侯家鸭脚子',
      '积雨辋川庄作'
    ]
  },
  {
    name: '湖蓝',
    color: '#30dff3',
    poems: [
      '镜湖增细縠，玉旻蔚浅蓝。',
      '天接海门秋水色，烟笼隋苑暮钟声。',
      '吴江水色连堤阔，越俗舂声隔岸还。'
    ],
    author: [
      '弘历',
      '许浑',
      '张祜'
    ],
    title: [
      '凉',
      '泊松江渡',
      '松江怀古'
    ]
  },
  {
    name: '湖绿',
    color: '#25f8cb',
    poems: [
      '春水满四泽，夏云多奇峰。秋月扬明晖，冬岭秀寒松。',
      '芳时淑气和，春水澹烟波。滉漾滋兰杜，沦涟长芰荷。',
      '一江涨碧碧於蓝，健橹鸣鹅舳正衔。'
    ],
    author: [
      '陶渊明',
      '朱休',
      '岳珂'
    ],
    title: [
      '四时',
      '春水绿波',
      '至鄂期年以饟事不给於诗己亥夏五廿有八日始'
    ]
  }
]

const WHITE = [
  {
    name: '精白',
    color: '#ffffff',
    poems: [
      '细雨霏霏梨花白，燕拂画帘金额。',
      '白雪却嫌春色晚，故穿庭树作飞花。',
      '小山重叠金明灭，鬓云欲度香腮雪。'
    ],
    author: [
      '韦庄',
      '韩愈',
      '温庭筠'
    ],
    title: [
      '清平乐・春愁南陌',
      '春雪',
      '菩萨蛮・小山重叠金明灭'
    ]
  },
  {
    name: '象牙白',
    color: '#fffbf0',
    poems: [
      '日晃帘栊晴喷雪，风回斋阁气生兰。',
      '象牙白齿双梳子，驼骨红纹小棹篦。',
      '玉容寂寞泪阑干，梨花一枝春带雨。'
    ],
    author: [
      '陆树声',
      '吕胜己',
      '白居易'
    ],
    title: [
      '玉兰',
      '鹧鸪天',
      '长恨歌'
    ]
  },
  {
    name: '雪白',
    color: '#f2fdff',
    poems: [
      '梅须逊雪三分白，雪却输梅一段香。',
      '忽如一夜春风来，千树万树梨花开。',
      '孤舟蓑笠翁，独钓寒江雪。'
    ],
    author: [
      '卢梅坡',
      '岑参',
      '柳宗元'
    ],
    title: [
      '雪梅・其一',
      '白雪歌送武判官归京',
      '江雪'
    ]
  },
  {
    name: '月白',
    color: '#d6ecf0',
    poems: [
      '月白烟青水暗流，孤猿衔恨叫中秋。',
      '东船西舫悄无言，唯见江心秋月白。',
      '酒渴起夜汲，月白天正青。'
    ],
    author: [
      '杜牧',
      '白居易',
      '陆游'
    ],
    title: [
      '猿',
      '琵琶行',
      '夜汲'
    ]
  },
  {
    name: '素',
    color: '#e0f0e9',
    poems: [
      '素衣莫起风尘叹，犹及清明可到家。'
    ],
    author: [
      '陆游'
    ],
    title: [
      '临安春雨初霁'
    ]
  },
  {
    name: '荼白',
    color: '#f3f9f1',
    poems: [
      '荼白花开风递香，枝横碧玉天然瘦。',
      '梅子金黄杏子肥，麦花雪白菜花稀。',
      '零落成泥碾作尘，只有香如故。'
    ],
    author: [
      '佚名',
      '范成大',
      '陆游'
    ],
    title: [
      '民间流传对荼白花描写的诗句',
      '四时田园杂兴・其二',
      '卜算子・咏梅'
    ]
  },
  {
    name: '霜色',
    color: '#e9f1f6',
    poems: [
      '月落乌啼霜满天，江枫渔火对愁眠。',
      '停车坐爱枫林晚，霜叶红于二月花。',
      '晓镜但愁云鬓改，夜吟应觉月光寒。'
    ],
    author: [
      '张继',
      '杜牧',
      '李商隐'
    ],
    title: [
      '枫桥夜泊',
      '山行',
      '无题・相见时难别亦难'
    ]
  },
  {
    name: '花白',
    color: '#c2ccd0',
    poems: [
      '桃花一簇开无主，可爱深红爱浅红。',
      '人闲桂花落，夜静春山空。',
      '白锦无纹香烂漫，玉树琼葩堆雪。'
    ],
    author: [
      '杜甫',
      '王维',
      '丘处机'
    ],
    title: [
      '江畔独步寻花・其六',
      '鸟鸣涧',
      '无俗念・灵虚宫梨花词'
    ]
  },
  {
    name: '鱼肚白',
    color: '#fcefe8',
    poems: [
      '东船西舫悄无言，唯见江心秋月白。',
      '落霞与孤鹜齐飞，秋水共长天一色。',
      '晓色初开，淡烟未散，风动霜华满路'
    ],
    author: [
      '白居易',
      '王勃',
      '张矩'
    ],
    title: [
      '琵琶行',
      '滕王阁序',
      '应天长・柳湖载酒'
    ]
  },
  {
    name: '莹白',
    color: '#e3f9fd',
    poems: [
      '素质鲜明绝点尘，冰轮高照转精神。'
    ],
    author: [
      '史铸'
    ],
    title: [
      '月下白'
    ]
  },
  {
    name: '灰色',
    color: '#808080',
    poems: [
      '远上寒山石径斜，白云生处有人家。',
      '烟笼寒水月笼沙，夜泊秦淮近酒家。',
      '千山鸟飞绝，万径人踪灭。孤舟蓑笠翁，独钓寒江雪。'
    ],
    author: [
      '杜牧',
      '杜牧',
      '柳宗元'
    ],
    title: [
      '山行',
      '泊秦淮',
      '江雪'
    ]
  },
  {
    name: '牙色',
    color: '#eedeb0',
    poems: [
      '水色天光上下寒，忘机鸥鸟恣飞还。',
      '梨花院落溶溶月，柳絮池塘淡淡风。'
    ],
    author: [
      '释文珦',
      '晏殊'
    ],
    title: [
      '题水天清话图',
      '寓意'
    ]
  },
  {
    name: '铅白',
    color: '#f0f0f4',
    poems: [
      '玉容寂寞泪阑干，梨花一枝春带雨。',
      '白锦无纹香烂漫，玉树琼葩堆雪。'
    ],
    author: [
      '白居易',
      '丘处机'
    ],
    title: [
      '长恨歌',
      '无俗念・灵虚宫梨花词'
    ]
  }
]

const BLACK = [
  {
    name: '玄色',
    color: '#622a1d',
    poems: ['我马玄黄盼草青，关河迢递梦魂停。'],
    author: ['蔡淑萍'],
    title: ['旅怀']
  },
  {
    name: '玄青',
    color: '#3d3b4f',
    poems: ['雨湿松阴凉，风落松花细。独鹤爱清幽，飞来不飞去。'],
    author: ['戴亨'],
    title: ['松鹤图']
  },
  {
    name: '乌色',
    color: '#725e82',
    poems: ['乌色天容暮，青怀道味长。'],
    author: ['李复'],
    title: ['依韵酬李叔玠见寄']
  },
  {
    name: '乌黑',
    color: '#392f41',
    poems: ['乌黑云头白脚花，尽从徽墨幻成家。'],
    author: ['徐渭'],
    title: ['画百花卷与史甥，题曰《漱老谑墨》']
  },
  {
    name: '漆黑',
    color: '#161823',
    poems: ['岩扉夜不掩，漆黑无寸光。'],
    author: ['徐勃'],
    title: ['宿鼓山绝顶']
  },
  {
    name: '墨色',
    color: '#50616d',
    poems: ['墨色淋漓人不见，空教蛱蝶绕东墙。'],
    author: ['徐勃'],
    title: ['画蝶']
  },
  {
    name: '墨灰',
    color: '#758a99',
    poems: ['墨灰融烛泪，酒色上花颜。'],
    author: ['王彦泓'],
    title: ['即事']
  },
  {
    name: '黑色',
    color: '#000000',
    poems: ['黑云压城城欲摧，甲光向日金鳞开。'],
    author: ['李贺'],
    title: ['雁门太守行']
  },
  {
    name: '缁色',
    color: '#493131',
    poems: ['缁尘素发惊残岁，故旧凋零已怕看。'],
    author: ['丘葵'],
    title: ['和所盘自宽韵']
  },
  {
    name: '煤黑',
    color: '#312520',
    poems: ['墨煤黑滑霜兔健，我亦自惜毛锥秃。'],
    author: ['苏轼'],
    title: ['次韵孔文仲推官见赠']
  },
  {
    name: '黧',
    color: '#5d513c',
    poems: ['山妻面黧黑，稚子发鬅鬙。'],
    author: ['方回'],
    title: ['秀山霜晴晚眺与赵宾旸黄惟月联句']
  },
  {
    name: '黎',
    color: '#75664d',
    poems: ['黎明发新邑，亭午过旧都。'],
    author: ['李廌'],
    title: ['送霍子侔还都']
  },
  {
    name: '黝',
    color: '#6b6882',
    poems: ['黝然苍石底，伏此垂老螭。'],
    author: ['强至'],
    title: ['怪石']
  },
  {
    name: '黝黑',
    color: '#665757',
    poems: ['土脉正膏腴，溜泉来黝黑。'],
    author: ['李吕'],
    title: ['题云谷耕隐']
  },
  {
    name: '黯',
    color: '#41555d',
    poems: ['黯黯江云瓜步雨，萧萧木叶石城秋。'],
    author: ['陆游'],
    title: ['登赏心亭']
  }
]

const GOLD = [
  {
    name: '赤金',
    color: '#f2be45',
    poems: ['赤金盘里盛朱橘，未到嘴边先觉香。'],
    author: ['韦庄'],
    title: ['叹庭前甘菊花']
  },
  {
    name: '金色',
    color: '#eacd76',
    poems: ['金色界中兜率景，碧莲花里梵王宫。'],
    author: ['释延寿'],
    title: ['武肃王有旨石桥设斋会进士一诗共六首 其四']
  },
  {
    name: '银白',
    color: '#e9e7ef',
    poems: ['银白香肌透骨鲜，堪随玉筯伴神仙。'],
    author: ['徐勃'],
    title: ['荔枝谱（有序） 其十六 丁香']
  },
  {
    name: '老银',
    color: '#bacac6',
    poems: ['老银色界月为骨，黄金仙山珠作林。'],
    author: ['杨万里'],
    title: ['雪后十日日暖雪犹未融']
  },
  {
    name: '乌金',
    color: '#a78e44',
    poems: ['乌金欲买愁无直，指佞空闻有此花。'],
    author: ['徐勃'],
    title: ['买石']
  },
  {
    name: '铜绿',
    color: '#549688',
    poems: ['雨余铜绿蚀蜗牛，庭砌无人草渐稠。'],
    author: ['华岳'],
    title: ['书斋']
  }
]

const LIST1 = [
  {
    name: '乳白',
    color: '#f9f4dc',
    poem: '玉容寂寞泪阑干，梨花一枝春带雨。',
    author: '白居易',
    title: '长恨歌'
  },
  {
    name: '杏仁黄',
    color: '#f7e8aa',
    poem: '岸苇新花白，山梨晚叶黄。',
    author: '许浑',
    title: '早秋三首·其一'
  },
  {
    name: '茉莉黄',
    color: '#f8df72',
    poem: '一卉能熏一室香，炎天犹觉玉肌凉。',
    author: '江奎',
    title: '茉莉'
  },
  {
    name: '麦秆黄',
    color: '#f8df70',
    poem: '田父腰镰待获忙，麦黄桑绿满川光。',
    author: '释文珦',
    title: '麦熟'
  },
  {
    name: '油菜花黄',
    color: '#fbda41',
    poem: '儿童急走追黄蝶，飞入菜花无处寻。',
    author: '杨万里',
    title: '宿新市徐公店'
  },
  {
    name: '佛手黄',
    color: '#fed71a',
    poem: '黄柑绿橘富霜枝，佛手香橼绕地垂。',
    author: '刘克庄',
    title: '食早荔七首·其一'
  },
  {
    name: '篾黄',
    color: '#f7de98',
    poem: '竹色溪下绿，荷花镜里香。',
    author: '李白',
    title: '别储邕之剡中'
  },
  {
    name: '葵扇黄',
    color: '#f8d86a',
    poem: '青虫也学庄周梦，化作南园蛱蝶黄。',
    author: '徐寅',
    title: '蝴蝶'
  },
  {
    name: '柠檬黄',
    color: '#fcd337',
    poem: '黄衫飞白马，日日青楼下。',
    author: '陈克',
    title: '菩萨蛮·绿芜墙绕青苔院'
  },
  {
    name: '金瓜黄',
    color: '#fcd217',
    poem: '黄金缀颗衬绿叶，五月落花香满庭。',
    author: '周必大',
    title: '咏鹅梨'
  },
  {
    name: '藤黄',
    color: '#ffd111',
    poem: '藤花无次第，万朵一时开。不是周从事，何人唤我来。',
    author: '白居易',
    title: '三月三日祓禊洛滨'
  },
  {
    name: '酪黄',
    color: '#f6dead',
    poem: '黄云连白草，万里有无间。',
    author: '王昌龄',
    title: '从军行七首·其三'
  },
  {
    name: '香水玫瑰黄',
    color: '#f7da94',
    poem: '玫瑰映肉色，菡萏坠莲房。',
    author: '李贺',
    title: '恼公'
  },
  {
    name: '淡密黄',
    color: '#f9d367',
    poem: '黄梅时节家家雨，青草池塘处处蛙。',
    author: '赵师秀',
    title: '约客'
  },
  {
    name: '大豆黄',
    color: '#fbcd31',
    poem: '黄粟留鸣桑椹美，紫樱桃熟麦风凉。',
    author: '欧阳修',
    title: '再至汝阴三绝·其一'
  },
  {
    name: '素馨黄',
    color: '#fccb16',
    poem: '素馨田远莫钱买，贱染黄衣打褶裥。',
    author: '屈大均',
    title: '素馨'
  },
  {
    name: '向日葵黄',
    color: '#fecc11',
    poem: '更无柳絮因风起，惟有葵花向日倾。',
    author: '司马光',
    title: '客中初夏'
  },
  {
    name: '雅梨黄',
    color: '#fbc82f',
    poem: '梨叶成荫杏子青，榴花相映可怜生。',
    author: '范成大',
    title: '初夏'
  },
  {
    name: '黄连黄',
    color: '#fcc515',
    poem: '黄连苦，黄蘖苦，奈何许。',
    author: '佚名',
    title: '读曲歌八十九首·其二十五'
  },
  {
    name: '金盏黄',
    color: '#fcc307',
    poem: '金盏银台相对望，一时妆点上林春。',
    author: '朱淑真',
    title: '新冬'
  },
  {
    name: '肉色',
    color: '#f7c173',
    poem: '肉色仙人绛罗襦，青腰玉女云为车。',
    author: '苏轼',
    title: '芙蓉城'
  },
  {
    name: '鹅掌黄',
    color: '#fbb929',
    poem: '鹅儿黄似酒，对酒爱新鹅。',
    author: '杜甫',
    title: '舟前小鹅儿'
  },
  {
    name: '鸡蛋黄',
    color: '#fbb612',
    poem: '黄鸡白酒，君去村社一番秋。',
    author: '辛弃疾',
    title: '水调歌头·送杨民瞻'
  },
  {
    name: '鼬黄',
    color: '#fcb70a',
    poem: '目前一径凭君出，不似人心蛇虺黄。',
    author: '贯休',
    title: '行路难·君不见山高海深人不测'
  },
  {
    name: '榴萼黄',
    color: '#f9a633',
    poem: '榴花红似火，榴萼绿于蓝。',
    author: '戴复古',
    title: '初夏游张园'
  },
  {
    name: '淡橘橙',
    color: '#fba414',
    poem: '一年好景君须记，最是橙黄橘绿时。',
    author: '苏轼',
    title: '赠刘景文'
  },
  {
    name: '枇杷黄',
    color: '#fca106',
    poem: '东园载酒西园醉，摘尽枇杷一树金。',
    author: '戴复古',
    title: '初夏游张园'
  },
  {
    name: '橙皮黄',
    color: '#fca104',
    poem: '橙子金香篱落，石榴红满帘旌。',
    author: '李处全',
    title: '西江月·夏日'
  },
  {
    name: '北瓜黄',
    color: '#fc8c23',
    poem: '南瓜垂野径，豆角绕柴扉。',
    author: '佚名',
    title: '无题'
  },
  {
    name: '雄黄',
    color: '#ff9900',
    poem: '粽包分两髻，艾束著危冠。旧俗方储药，羸躯亦点丹',
    author: '陆游',
    title: '乙卯重五诗'
  },
  {
    name: '万寿菊黄',
    color: '#fb8b05',
    poem: '秋满篱根始见花，却从冷淡遇繁华。',
    author: '屈大均',
    title: '题画菊'
  },
  {
    name: '菊蕾白',
    color: '#e9ddb6',
    poem: '满园花菊郁金黄，中有孤丛色似霜。',
    author: '白居易',
    title: '重阳席上赋白菊'
  },
  {
    name: '秋葵黄',
    color: '#eed045',
    poem: '愁生陌上黄秋葵，梦远江南乌夜村。',
    author: '王士祯',
    title: '秋柳四首·其一'
  },
  {
    name: '硫华黄',
    color: '#f2ce2b',
    poem: '硫黄强暖骨，白发终不生。',
    author: '曹邺',
    title: '四怨三愁五情诗十二首·其三'
  },
  {
    name: '柚黄',
    color: '#f1ca17',
    poem: '青惜峰峦过，黄知橘柚来。',
    author: '杜甫',
    title: '放船'
  },
  {
    name: '蒿黄',
    color: '#dfc243',
    poem: '秋风生渭水，落叶满长安。',
    author: '贾岛',
    title: '忆江上吴处士'
  },
  {
    name: '姜黄',
    color: '#e2c027',
    poem: '姜宜山茗留闲啜，菊倚秋风把醉看。',
    author: '郑谷',
    title: '敷溪高士'
  },
  {
    name: '月灰',
    color: '#b7ae8f',
    poem: '月既不解饮，影徒随我身。暂伴月将影，行乐须及春。',
    author: '李白',
    title: '月下独酌四首·其一'
  },
  {
    name: '草灰绿',
    color: '#8e804b',
    poem: '离离原上草，一岁一枯荣。野火烧不尽，春风吹又生。',
    author: '白居易',
    title: '赋得古原草送别'
  },
  {
    name: '苔绿',
    color: '#887322',
    poem: '苔痕上阶绿，草色入帘青。',
    author: '刘禹锡',
    title: '陋室铭'
  },
  {
    name: '碧螺春绿',
    color: '#867018',
    poem: '竹雨松风琴韵，茶烟梧月书声。',
    author: '张潮',
    title: '幽梦影'
  },
  {
    name: '燕羽灰',
    color: '#685e48',
    poem: '无可奈何花落去，似曾相识燕归来。',
    author: '晏殊',
    title: '浣溪沙·一曲新词酒一杯'
  },
  {
    name: '蟹壳灰',
    color: '#695e45',
    poem: '未游沧海早知名，有骨还从肉上生。',
    author: '皮日休',
    title: '咏蟹'
  },
  {
    name: '潭水绿',
    color: '#645822',
    poem: '桃花潭水深千尺，不及汪伦送我情。',
    author: '李白',
    title: '赠汪伦'
  },
  {
    name: '橄榄绿',
    color: '#5e5314',
    poem: '纷纷青子落红盐，正味森森苦且严。',
    author: '黄庭坚',
    title: '橄榄'
  },
  {
    name: '蚌肉白',
    color: '#f9f1db',
    poem: '沧海月明珠有泪，蓝田日暖玉生烟。',
    author: '李商隐',
    title: '锦瑟'
  },
  {
    name: '乳鸭黄',
    color: '#ffc90c',
    poem: '竹外桃花三两枝，春江水暖鸭先知。',
    author: '苏轼',
    title: '惠崇春江晚景二首'
  },
  {
    name: '荔肉白',
    color: '#f2e6ce',
    poem: '日啖荔枝三百颗，不辞长作岭南人。',
    author: '苏轼',
    title: '惠州一绝 / 食荔枝'
  },
  {
    name: '浅烙黄',
    color: '#f9bd10',
    poem: '大漠孤烟直，长河落日圆。',
    author: '王维',
    title: '使至塞上'
  },
  {
    name: '莲子白',
    color: '#e5d3aa',
    poem: '涉江采芙蓉，兰泽多芳草。',
    author: '佚名',
    title: '涉江采芙蓉'
  },
  {
    name: '谷黄',
    color: '#e8b004',
    poem: '春种一粒粟，秋收万颗子。',
    author: '李绅',
    title: '悯农二首·其一'
  },
  {
    name: '栀子黄',
    color: '#ebb10d',
    poem: '栀子比众木，人间诚未多。',
    author: '杜甫',
    title: '栀子'
  },
  {
    name: '芥黄',
    color: '#d9a40e',
    poem: '黄花翠蔓无人愿，浪得迎春世上名。',
    author: '刘敞',
    title: '阁前迎春花'
  },
  {
    name: '银鼠灰',
    color: '#b5aa90',
    poem: '晴空一鹤排云上，便引诗情到碧霄。',
    author: '刘禹锡',
    title: '秋词二首·其一'
  },
  {
    name: '尘灰',
    color: '#b6a476',
    poem: '千淘万漉虽辛苦，吹尽狂沙始到金。',
    author: '刘禹锡',
    title: '浪淘沙·其八'
  },
  {
    name: '枯绿',
    color: '#b78d12',
    poem: '沉舟侧畔千帆过，病树前头万木春。',
    author: '刘禹锡',
    title: '酬乐天扬州初逢席上见赠'
  },
  {
    name: '粽叶绿',
    color: '#876818',
    poem: '春风如醇酒，著物物不知。绿了芭蕉，红了樱桃。',
    author: '程致道',
    title: '偶成'
  },
  {
    name: '淡松烟',
    color: '#4d4030',
    poem: '不畏浮云遮望眼，自缘身在最高层。',
    author: '王安石',
    title: '登飞来峰'
  },
  {
    name: '麦芽糖黄',
    color: '#f9d27d',
    poem: '芳林新叶催陈叶，流水前波让后波。',
    author: '刘禹锡',
    title: '乐天见示伤微之、敦诗、晦叔三君子，皆有深分，因成是诗以寄'
  },
  {
    name: '沙石黄',
    color: '#e5b751',
    poem: '黄沙百战穿金甲，不破楼兰终不还。',
    author: '王昌龄',
    title: '从军行七首·其四'
  },
  {
    name: '百灵鸟灰',
    color: '#b4a992',
    poem: '千峰笋石千株玉，万树松萝万朵银',
    author: '元稹',
    title: '使东川·南秦雪'
  },
  {
    name: '龟背黄',
    color: '#826b48',
    poem: '碧云天，黄叶地，秋色连波，波上寒烟翠',
    author: '范仲淹',
    title: '苏幕遮·怀旧'
  },
  {
    name: '苍黄',
    color: '#806332',
    poem: '莫道桑榆晚，为霞尚满天。',
    author: '刘禹锡',
    title: '酬乐天咏老见示'
  },
  {
    name: '莱阳梨黄',
    color: '#815f25',
    poem: '梨叶成荫杏子青，榴花相映可怜生。',
    author: '范成大',
    title: '初夏'
  },
  {
    name: '蜴蜊绿',
    color: '#835e1d',
    poem: '苔痕上阶绿，草色入帘青。',
    author: '刘禹锡',
    title: '陋室铭'
  },
  {
    name: '粉白',
    color: '#fbf2e3',
    poem: '云想衣裳花想容，春风拂槛露华浓。',
    author: '李白',
    title: '清平调·其一'
  },
  {
    name: '落英淡粉',
    color: '#f9e8d0',
    poem: '人面不知何处去，桃花依旧笑春风。',
    author: '崔护',
    title: '题都城南庄'
  },
  {
    name: '金叶黄',
    color: '#ffa60f',
    poem: '冲天香阵透长安，满城尽带黄金甲。',
    author: '黄巢',
    title: '不第后赋菊'
  },
  {
    name: '金莺黄',
    color: '#f4a83a',
    poem: '两个黄鹂鸣翠柳，一行白鹭上青天。',
    author: '杜甫',
    title: '绝句四首·其三'
  },
  {
    name: '玳瑁黄',
    color: '#daa45a',
    poem: '黄云万里动风色，白波九道流雪山。',
    author: '李白',
    title: '庐山谣寄卢侍御虚舟'
  },
  {
    name: '玫瑰粉',
    color: '#f8b37f',
    poem: '晓看红湿处，花重锦官城。',
    author: '杜甫',
    title: '春夜喜雨'
  },
  {
    name: '橘橙',
    color: '#f97d1c',
    poem: '一年好景君须记，最是橙黄橘绿时。',
    author: '苏轼',
    title: '赠刘景文'
  },
  {
    name: '海螺橙',
    color: '#f0945d',
    poem: '黄菊枝头生晓寒，人生莫放酒杯干。',
    author: '黄庭坚',
    title: '鹧鸪天·座中有眉山隐客史应之和前韵即席答之'
  },
  {
    name: '颊红',
    color: '#eeaa9c',
    poem: '笑渐不闻声渐悄，多情却被无情恼。',
    author: '苏轼',
    title: '蝶恋花·春景'
  },
  {
    name: '淡罂粟红',
    color: '#eea08c',
    poem: '何须浅碧深红色，自是花中第一流。',
    author: '李清照',
    title: '鹧鸪天·桂花'
  },
  {
    name: '晨曦红',
    color: '#ea8958',
    poem: '晓镜但愁云鬓改，夜吟应觉月光寒。',
    author: '李商隐',
    title: '无题·相见时难别亦难'
  },
  {
    name: '蜻蜓红',
    color: '#f1441d',
    poem: '小荷才露尖尖角，早有蜻蜓立上头。',
    author: '杨万里',
    title: '小池'
  },
  {
    name: '榴花红',
    color: '#f34718',
    poem: '五月榴花照眼明，枝间时见子初成。',
    author: '韩愈',
    title: '题张十一旅舍三咏・榴花'
  },
  {
    name: '银朱',
    color: '#f43e06',
    poem: '何须浅碧深红色，自是花中第一流。',
    author: '李清照',
    title: '鹧鸪天・桂花'
  },
  {
    name: '金黄',
    color: '#f26b1f',
    poem: '冲天香阵透长安，满城尽带黄金甲。',
    author: '黄巢',
    title: '不第后赋菊'
  },
  {
    name: '石板灰',
    color: '#624941',
    poem: '千锤万凿出深山，烈火焚烧若等闲。',
    author: '于谦',
    title: '石灰吟'
  },
  {
    name: '玉粉红',
    color: '#e8b49a',
    poem: '人面不知何处去，桃花依旧笑春风。',
    author: '崔护',
    title: '题都城南庄'
  },
  {
    name: '野蔷薇红',
    color: '#fb9968',
    poem: '水晶帘动微风起，满架蔷薇一院香。',
    author: '高骈',
    title: '山亭夏日'
  },
  {
    name: '海报灰',
    color: '#483332',
    poem: '千锤万凿出深山，烈火焚烧若等闲。',
    author: '于谦',
    title: '石灰吟'
  },
  {
    name: '初桃粉红',
    color: '#f6dcce',
    poem: '人面不知何处去，桃花依旧笑春风。',
    author: '崔护',
    title: '题都城南庄'
  },
  {
    name: '介壳淡粉红',
    color: '#f7cfba',
    poem: '沾衣欲湿杏花雨，吹面不寒杨柳风。',
    author: '志南',
    title: '绝句・古木阴中系短篷'
  },
  {
    name: '淡藏花红',
    color: '#f6ad8f',
    poem: '草树知春不久归，百般红紫斗芳菲。',
    author: '韩愈',
    title: '晚春二首・其一'
  },
  {
    name: '芙蓉红',
    color: '#f9723d',
    poem: '清水出芙蓉，天然去雕饰。',
    author: '李白',
    title: '经乱离后天恩流夜郎忆旧游书怀赠江夏韦太守良宰'
  },
  {
    name: '落霞红',
    color: '#cf4813',
    poem: '落霞与孤鹜齐飞，秋水共长天一色。',
    author: '王勃',
    title: '滕王阁序'
  },
  {
    name: '桂红',
    color: '#f25a47',
    poem: '何须浅碧深红色，自是花中第一流。',
    author: '李清照',
    title: '鹧鸪天・桂花'
  },
  {
    name: '粉红',
    color: '#f2b9b2',
    poem: '去年今日此门中，人面桃花相映红。',
    author: '崔护',
    title: '题都城南庄'
  },
  {
    name: '榴子红',
    color: '#f1908c',
    poem: '五月榴花照眼明，枝间时见子初成。 ',
    author: '韩愈',
    title: '题张十一旅舍三咏・榴花'
  },
  {
    name: '春梅红',
    color: '#f1939c',
    poem: '不经一番寒彻骨，怎得梅花扑鼻香。',
    author: '黄蘖禅师',
    title: '上堂开示颂'
  },
  {
    name: '樱桃红',
    color: '#ed3321',
    poem: '流光容易把人抛，红了樱桃，绿了芭蕉。',
    author: '蒋捷',
    title: '一剪梅・舟过吴江'
  },
  {
    name: '茶花红',
    color: '#ee3f4d',
    poem: '待到山花烂漫时，她在丛中笑。',
    author: '毛泽东',
    title: '卜算子・咏梅'
  },
  {
    name: '夕阳红',
    color: '#de2a18',
    poem: '莫道桑榆晚，为霞尚满天。',
    author: '刘禹锡',
    title: '酬乐天咏老见示'
  },
  {
    name: '牡丹粉红',
    color: '#eea2a4',
    poem: '唯有牡丹真国色，花开时节动京城。',
    author: '刘禹锡',
    title: '赏牡丹'
  },
  {
    name: '山茶红',
    color: '#ed556a',
    poem: '山花山开春未归，春归正值花盛时。',
    author: '杨万里',
    title: '明发西馆晨炊蔼冈四首其一'
  },
  {
    name: '海棠红',
    color: '#f03752',
    poem: '知否，知否？应是绿肥红瘦。',
    author: '李清照',
    title: '如梦令・昨夜雨疏风骤'
  },
  {
    name: '葡萄紫',
    color: '#4c1f24',
    poem: '葡萄美酒夜光杯，欲饮琵琶马上催。',
    author: '王翰',
    title: '凉州词二首・其一'
  },
  {
    name: '枫叶红',
    color: '#c21f30',
    poem: '停车坐爱枫林晚，霜叶红于二月花。',
    author: '杜牧',
    title: '山行'
  },
  {
    name: '月季红',
    color: '#ce5777',
    poem: '花开不并百花丛，独立疏篱趣未穷。',
    author: '郑思肖',
    title: '寒菊 / 画菊'
  },
  {
    name: '霞光红',
    color: '#ef82a0',
    poem: '莫道桑榆晚，为霞尚满天。',
    author: '刘禹锡',
    title: '酬乐天咏老见示'
  },
  {
    name: '葡萄酒红',
    color: '#62102e',
    poem: '葡萄美酒夜光杯，欲饮琵琶马上催。',
    author: '王翰',
    title: '凉州词二首・其一'
  },
  {
    name: '凤信紫',
    color: '#c8adc4',
    poem: '含光紫瓣如甄女，弄影蓝苞若谢娘'
  },
  {
    name: '槿紫',
    color: '#806d9e',
    poem: '紫雾函灯檠，彤霞逼绮寮'
  },
  {
    name: '蕈紫',
    color: '#815c94',
    poem: '蕈紫花中最可人，翠凤衣裳玉面新'
  },
  {
    name: '桔梗紫',
    color: '#813c85',
    poem: '桔梗花开映碧霄，紫蓝烂漫韵千条'
  },
  {
    name: '粉米',
    color: '#efc4ce',
    poem: '粉堕百花州，香残燕子楼',
    author: '曹雪芹',
    title: '唐多令·粉堕百花州'
  },
  {
    name: '美人祭',
    color: '#c35c6a',
    poem: '垆边人似月，皓腕凝霜雪',
    author: '韦庄',
    title: '菩萨蛮·人人尽说江南好'
  },
  {
    name: '鞓红',
    color: '#b04552',
    poem: '红粉青娥映楚云，桃花马上石榴裙',
    author: '李颀',
    title: '杂曲歌辞·缓歌行'
  }
]
export default [...GRAYS, ...REDS, ...YELLOW, ...GREENS, ...BLUES, ...WATER, ...WHITE, ...BLACK, ...GOLD, ...LIST1]
